In [1]:
import pandas as pd

#### Q1. List any five functions of the pandas library with execution.

In [17]:
data={
'Name':['John Doe','Charlie','Chris'],
    'age':[25,23,26]
    
}

In [18]:
#pd.DataFrame():
df=pd.DataFrame(data)

In [23]:
#df.head():
df.head()

       Name  New_Col  age
0  John Doe        0   25
1   Charlie        0   23
2     Chris        0   26

In [19]:
#df.loc():
df.loc[0:2]

       Name  age
0  John Doe   25
1   Charlie   23
2     Chris   26

In [20]:
#df.insert():
df.insert(1,'New_Col',0)

In [21]:
df

       Name  New_Col  age
0  John Doe        0   25
1   Charlie        0   23
2     Chris        0   26

In [22]:
#df.drop():
df.drop([0,1])

    Name  New_Col  age
2  Chris        0   26

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [33]:
data1={'A':[1,2,3],
       'B':[4,5,6],
       'C':[7,8,9]
      }

df1=pd.DataFrame(data1)

In [46]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [53]:
df.reset_index(drop=True, inplace=True)
df.index = df.index.map(lambda x: x*2 + 1)

In [54]:
df

       Name  New_Col  age
1  John Doe        0   25
3   Charlie        0   23
5     Chris        0   26

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [55]:
df=pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

In [88]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [87]:

def Val_sum(df):
    y=0
    for i in df[0:3]:
        y+=i
    return y   
Val_sum(df['Values'][0:3])

60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [99]:
df=pd.DataFrame({'Text':['Text0','Text01','Text010','Text011']})

In [102]:
def add_col(df):
    df['Text_len']=df['Text'].apply(len)

add_col(df)

In [107]:
df

      Text  Text_len
0    Text0         5
1   Text01         6
2  Text010         7
3  Text011         7

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [105]:
df.shape

(4, 2)

In [106]:
df.size

8

DataFrame.size gives the total number of the elements in the dataframe while DataFrame.shape gives the number of elements and number of columns in the dataframe.

#### Q6. Which function of pandas do we use to read an excel file?

pandas.read_excel('File_name') function is used to read an excel file.

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [14]:
df=pd.DataFrame({'Email':['JohnDoe@example.com','JonathanWick@example.com','AndrewNeimann@example.com']})

In [22]:
def username(df):
    df['Username'] = df['Email'].str.split('@').str[0]

username(df)

In [23]:
df

                       Email       Username
0        JohnDoe@example.com        JohnDoe
1   JonathanWick@example.com   JonathanWick
2  AndrewNeimann@example.com  AndrewNeimann

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [25]:
df=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,8,6],'C':[7,1,5,3,9]})

In [31]:
df

   A  B  C
0  3  5  7
1  8  2  1
2  6  9  5
3  2  8  3
4  9  6  9

In [30]:
def grt(df):
    df1=df[(df['A']>5) & (df['B']<10)]
    return df1
grt(df)

   A  B  C
1  8  2  1
2  6  9  5
4  9  6  9

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [3]:
df=pd.DataFrame({'Values':[8,5,1,9,10,11]})

In [4]:
def description(df):
    md= df['Values'].median()
    mn=df['Values'].mean()
    std=df['Values'].std()
    print(f'mean:{mn} median:{md} standard deviation:{std}')
description(df)

mean:7.333333333333333 median:8.5 standard deviation:3.723797345005051

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [34]:
data = {'Sales': [100, 150, 200, 180, 220,250,270],
        'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-01-06','2023-01-07']}

df = pd.DataFrame(data)

In [32]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [33]:
calculate_moving_average(df)

   Sales        Date  MovingAverage
0    100  2023-01-01     100.000000
1    150  2023-01-02     125.000000
2    200  2023-01-03     150.000000
3    180  2023-01-04     157.500000
4    220  2023-01-05     170.000000
5    250  2023-01-06     183.333333
6    270  2023-01-07     195.714286

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [35]:
data={'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05','2023-01-06','2023-01-07']}

df=pd.DataFrame(data)

In [42]:

def add_weekday_column(df):
    df['Weekday'] = pd.to_datetime(df['Date']).dt.strftime('%A')
    return df

In [43]:
add_weekday_column(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [47]:
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-10', '2023-01-15', '2023-02-01', '2023-02-10']})

In [51]:
def req_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])
    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return selected_rows

In [53]:
req_dates(df)

        Date
0 2023-01-01
1 2023-01-15

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The Library required is Pandas.